module.exports = {
  'zh-cn': {
    user: {
      login_failed: '用户名或密码错误',
      logout_failed: '退出登录失败',
      signup_failed: '注册失败',
      signup_duplicate_failed: '用户名已存在',
      signup_success: '注册成功',
      get_user_failed: '获取用户信息失败',
      get_self_failed: '获取账户信息失败'
    },

    feed: {
      upload_failed: '上传图片失败',
      upload_success: '上传图片成功',
      create_feed_failed: '删除图片失败',
      create_feed_success: '删除图片成功',
      list_feed_failed: '获取图片流错误',
      get_feed_failed: '获取评论失败',
      create_comment_failed: '评论图片失败',
      create_comment_success: '评论图片成功',
      vote_feed_failed: '评分失败',
      vote_feed_success: '评分成功'
    },

    button: {
      retry: '重试',
      ignore: '忽略',
      ok: '确定',
      cancel: '取消'
    },

    share: {
      prefix: "我的颜值得分%s:",
      postfix: "快来给我打分吧！！",
      score: {
        1: [
          "地球太危险，我要回火星！",
          "你要信我真人比照片好看！",
          "我要去扁这个开发者！！",
          "这个世界充满了恶意！！",
          "我们注重的是内涵！！",
          "请问我还有救么？",
          "这个应用一点都不好玩。",
          "伐开心，要包包！！",
          "叔叔约么？",
          "我已经定了去韩国的机票。",
          "原来我妈一直在骗我 TT",
          "我们还能做朋友么？",
          "我的颜值天下第一！！",
          "颜值这么高，然而并没有什么卵用",
          "我颜值这么高，妈妈再也不用担心我找对象了"
        ],
        7: [
          "我觉得我应该比现在高！！",
          "伐开心，要包包！！",
          "叔叔约么？",
          "这个应用一点都不好玩。",
          "我们还能做朋友么？",
          "我的颜值天下第一！！",
          "颜值这么高，然而并没有什么卵用",
          "我颜值这么高，妈妈再也不用担心我找对象了"
        ],
        9: [
          "我的颜值爆表了！！",
          "其实外表一点都不重要，哈哈",
          "我就是随手测试一下 :)",
          "颜值高到没有朋友 TT",
          "这个应用一点都不好玩。",
          "叔叔，叔叔，我们不约！！",
          "叔叔约么？",
          "伐开心，要包包！！",
          "关关雎鸠，在河之洲，窈窕淑女，君子好逑",
          "我们还能做朋友么？",
          "我的颜值天下第一！！",
          "颜值这么高，然而并没有什么卵用",
          "我颜值这么高，妈妈再也不用担心我找对象了"
        ]
      }
    }
  }
}
